export const messages = {
  type: {
    empty: 'Тип объекта не может быть пустым!',
    wrong: 'Неправильный тип объекта: %',
    success: ''
  },
  category: {
    empty: 'Категория не может быть пустой.',
    wrong: 'Такой категории не существует: %',
    success: ''
  },
  size: {
    wrong: 'Поля % неправильного формата или не заполнены. \nЭто должны быть положительные числа.',
    empty: 'Вы не определили размер вашего объекта.',
    null: 'Все поля обязательны для ввода. Одно из них заполнено неправильным. Это должно быть положительно число',
    livingMoreThanTotal: 'Жилая площадь не может быть больше общей.',
    success: ''
  },
  location: {
    empty: 'Адрес не может быть пустым!',
    success: ''
  },
  floors: {
    empty: 'Этажность необходимо заполнить',
    emptyAmount: 'Вы не ввели общее количество этажей.',
    wrong: 'Ваш этаж не может быть больше общего количества этажей.',
    success: ''
  },
  images: {
    empty: 'Вы не загрузили фотографии!',
    success: ''
  },
  title: {
    empty: 'Заголовок не может быть пустым'
  },

  facilities: {
    empty: 'Удобства не могут быть пустыми!',
    wrong: 'Неправильный(-е) тип(-ы) удобств(-а): %',
    success: ''
  },
  rules: {
    empty: 'Правила дома не могут быть пустыми!',
    wrong: 'Неправильный(-е) тип(-ы) правил(-а): %',
    success: ''
  },
  amenities: {
    empty: 'Помещения не могут быть пустыми!',
    wrong: 'Неправильный(-е) тип(-ы) помещения(-й): %',
    success: ''
  },
  term: {
    empty: 'Срок сдачи не может быть пустыми!',
    wrong: 'Неправильный тип срока: %',
    success: ''
  },

  price: {
    empty: 'Стоимость не может быть пустой!',
    wrong: 'Вы не указали цену!',
    wrongInput: '% не может быть меньше 0',
    wrongAmount: 'Стоимость объекта не может быть меньше 0 или 0',
    success: ''
  }
};
