export default {
  email: {
    empty: 'Пожалуйста, введите Вашу почту',
    wrong: 'Неправильный формат вводимых данных \nПожалуйста, введите почту',
    success: 'Почта подходит'
  },
  password: {
    empty: 'Пожалуйста, введите пароль',
    wrong: 'Ваш пароль очень короткий \nВведите, пожалуйста, больше 4-ех символов',
    normal: 'Ваш пароль длиной меньше 8-ми \nЭто нормально, но больше - лучше',
    success: 'Отличный пароль!'
  },
  name: {
    empty: 'Пожалуйста, введите Ваше имя',
    wrong: 'Произошла неизвестная ошибка',
    normal: 'Интересное имя в 2 символа \nВы уверены, что это ваше имя?',
    success: 'Отличное имя!'
  },
  phone: {
    empty: 'Пожалуйста, введите Ваш телефон. \nОн необходим нам для подтверждения.',
    wrong: 'Неверный формат вводимых данных Пожалуйста, введите номер телефона',
    NaN: 'Вы ввели не цифры',
    short: 'Введеный номер телефона слишком короткий',
    success: 'Номер что надо!'
  },
  message: {
    empty: 'Вы уверены, что не хотите ничего добавить?',
    success: 'Хорошо, постараемся учесть!'
  }
};
